tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "python@3.8"
brew "ansible"
brew "curl"
brew "mysql@5.7", restart_service: true
brew "node"
brew "redis"
brew "tree"
brew "zsh"
cask "docker"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "notion"
cask "postman"
cask "stretchly"
cask "tableplus"
cask "visual-studio-code"
