tap "adoptopenjdk/openjdk"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
brew "gh"
brew "node"
brew "mongosh"
brew "mysql", restart_service: true
brew "openjdk@17"
brew "python@3.11"
brew "redis", restart_service: true
brew "tree"
brew "walk"
brew "zsh"
brew "mongodb/brew/mongodb-community"
cask "docker"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "medis"
cask "monodraw"
cask "notion"
cask "slack"
cask "spectacle"
cask "stretchly"
cask "tableplus"
cask "visual-studio-code"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "humao.rest-client"
vscode "vscodevim.vim"
vscode "zenghongtu.vscode-asciiflow2"
