tap "adoptopenjdk/openjdk"
tap "elastic/tap"
tap "mongodb/brew"
brew "awscli"
brew "bat"
brew "gh"
brew "git-filter-repo"
brew "git-flow", link: false
brew "git-flow-avh"
brew "git-lfs"
brew "gradle"
brew "h2"
brew "hurl"
brew "jenv"
brew "mariadb", restart_service: :changed
brew "node"
brew "mongosh"
brew "mysql", restart_service: true
brew "n"
brew "neofetch"
brew "openjdk@17"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "redis", restart_service: :changed
brew "tree"
brew "walk"
brew "zsh"
brew "mongodb/brew/mongodb-community"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "datagrip"
cask "docker"
cask "drawio"
cask "figma"
cask "firefox"
cask "fliqlo"
cask "font-fira-code"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "medis"
cask "monodraw"
cask "notion"
cask "slack"
cask "obsidian"
cask "rectangle"
cask "stretchly"
cask "tableplus"
cask "visual-studio-code"
cask "webstorm"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "humao.rest-client"
vscode "vscodevim.vim"
vscode "zenghongtu.vscode-asciiflow2"
